nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt1180/driver_examples/flexspi_flr/ocram/polling_transfer/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A14, peripheral: FLEXSPI1, signal: FLEXSPI_B_DQS, pin_signal: GPIO_B1_03, software_input_on: Disable}
  - {pin_num: B13, peripheral: FLEXSPI1, signal: FLEXSPI_B_SS0_B, pin_signal: GPIO_B1_04, software_input_on: Disable}
  - {pin_num: B12, peripheral: FLEXSPI1, signal: FLEXSPI_B_SCLK, pin_signal: GPIO_B1_05, software_input_on: Disable}
  - {pin_num: B11, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA0, pin_signal: GPIO_B1_13, software_input_on: Disable}
  - {pin_num: A11, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA1, pin_signal: GPIO_B1_12, software_input_on: Disable}
  - {pin_num: A12, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA2, pin_signal: GPIO_B1_11, software_input_on: Disable}
  - {pin_num: A13, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA3, pin_signal: GPIO_B1_10, software_input_on: Disable}
  - {pin_num: A15, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA4, pin_signal: GPIO_B1_09, software_input_on: Disable}
  - {pin_num: B14, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA5, pin_signal: GPIO_B1_08, software_input_on: Disable}
  - {pin_num: D13, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA6, pin_signal: GPIO_B1_07, software_input_on: Disable}
  - {pin_num: B10, peripheral: FLEXSPI1, signal: FLEXSPI_B_DATA7, pin_signal: GPIO_B1_06, software_input_on: Disable}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, software_input_on: Disable}
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, software_input_on: Disable}
  - {pin_num: A10, peripheral: FLEXSPI_SLV, signal: 'DATA, 0', pin_signal: GPIO_B2_10, software_input_on: Disable}
  - {pin_num: B9, peripheral: FLEXSPI_SLV, signal: 'DATA, 1', pin_signal: GPIO_B2_11, software_input_on: Disable}
  - {pin_num: A8, peripheral: FLEXSPI_SLV, signal: 'DATA, 2', pin_signal: GPIO_B2_12, software_input_on: Disable}
  - {pin_num: B8, peripheral: FLEXSPI_SLV, signal: 'DATA, 3', pin_signal: GPIO_B2_13, software_input_on: Disable}
  - {pin_num: D9, peripheral: FLEXSPI_SLV, signal: 'DATA, 4', pin_signal: GPIO_B2_03, software_input_on: Disable}
  - {pin_num: C9, peripheral: FLEXSPI_SLV, signal: 'DATA, 5', pin_signal: GPIO_B2_04, software_input_on: Disable}
  - {pin_num: A9, peripheral: FLEXSPI_SLV, signal: 'DATA, 6', pin_signal: GPIO_B2_05, software_input_on: Disable}
  - {pin_num: E8, peripheral: FLEXSPI_SLV, signal: 'DATA, 7', pin_signal: GPIO_B2_06, software_input_on: Disable}
  - {pin_num: A6, peripheral: FLEXSPI_SLV, signal: DQS, pin_signal: GPIO_B2_07, software_input_on: Disable}
  - {pin_num: A7, peripheral: FLEXSPI_SLV, signal: CLK, pin_signal: GPIO_B2_08, software_input_on: Enable}
  - {pin_num: D10, peripheral: FLEXSPI_SLV, signal: CS, pin_signal: GPIO_B2_09, software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_03_FLEXSPI1_BUS2BIT_B_DQS,  /* GPIO_B1_03 is configured as FLEXSPI1_BUS2BIT_B_DQS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_04_FLEXSPI1_BUS2BIT_B_SS0_B,  /* GPIO_B1_04 is configured as FLEXSPI1_BUS2BIT_B_SS0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_05_FLEXSPI1_BUS2BIT_B_SCLK,  /* GPIO_B1_05 is configured as FLEXSPI1_BUS2BIT_B_SCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_06_FLEXSPI1_BUS2BIT_B_DATA07,  /* GPIO_B1_06 is configured as FLEXSPI1_BUS2BIT_B_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_07_FLEXSPI1_BUS2BIT_B_DATA06,  /* GPIO_B1_07 is configured as FLEXSPI1_BUS2BIT_B_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_08_FLEXSPI1_BUS2BIT_B_DATA05,  /* GPIO_B1_08 is configured as FLEXSPI1_BUS2BIT_B_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_09_FLEXSPI1_BUS2BIT_B_DATA04,  /* GPIO_B1_09 is configured as FLEXSPI1_BUS2BIT_B_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_10_FLEXSPI1_BUS2BIT_B_DATA03,  /* GPIO_B1_10 is configured as FLEXSPI1_BUS2BIT_B_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_11_FLEXSPI1_BUS2BIT_B_DATA02,  /* GPIO_B1_11 is configured as FLEXSPI1_BUS2BIT_B_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_12_FLEXSPI1_BUS2BIT_B_DATA01,  /* GPIO_B1_12 is configured as FLEXSPI1_BUS2BIT_B_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B1_13_FLEXSPI1_BUS2BIT_B_DATA00,  /* GPIO_B1_13 is configured as FLEXSPI1_BUS2BIT_B_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_03_XSPI_SLV_DATA04,      /* GPIO_B2_03 is configured as XSPI_SLV_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_04_XSPI_SLV_DATA05,      /* GPIO_B2_04 is configured as XSPI_SLV_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_05_XSPI_SLV_DATA06,      /* GPIO_B2_05 is configured as XSPI_SLV_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_06_XSPI_SLV_DATA07,      /* GPIO_B2_06 is configured as XSPI_SLV_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_07_XSPI_SLV_DQS,         /* GPIO_B2_07 is configured as XSPI_SLV_DQS */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_08_XSPI_SLV_CLK,         /* GPIO_B2_08 is configured as XSPI_SLV_CLK */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_B2_08 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_09_XSPI_SLV_CS,          /* GPIO_B2_09 is configured as XSPI_SLV_CS */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_B2_09 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_10_XSPI_SLV_DATA00,      /* GPIO_B2_10 is configured as XSPI_SLV_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_11_XSPI_SLV_DATA01,      /* GPIO_B2_11 is configured as XSPI_SLV_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_12_XSPI_SLV_DATA02,      /* GPIO_B2_12 is configured as XSPI_SLV_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_B2_13_XSPI_SLV_DATA03,      /* GPIO_B2_13 is configured as XSPI_SLV_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_08_LPUART1_TX,          /* GPIO_AON_08 is configured as LPUART1_TX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_09_LPUART1_RX,          /* GPIO_AON_09 is configured as LPUART1_RX */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
